trunk/pocketsoap/unitTests-com/msgs/testSoap12Array.xml

<E:Envelope
    xmlns:XS="http://www.w3.org/2001/XMLSchema"
    xmlns:XI="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:Q="http://www.w3.org/2003/05/soap-encoding"
    xmlns:E="http://www.w3.org/2003/05/soap-envelope"
    xmlns:a="urn:tests">
 <E:Body>
    <a:foo E:encodingStyle="http://www.w3.org/2003/05/soap-encoding">
	    <a Q:arraySize="3" Q:itemType="XS:int">
    		<i XI:type="XS:int">1</i>
    		<i XI:type="XS:int">2</i>
    		<i XI:type="XS:int">3</i>
    	</a>
    	<b Q:arraySize="*" Q:itemType="XS:int">
    		<i XI:type="XS:int">1</i>
    		<i XI:type="XS:int">2</i>
    		<i XI:type="XS:int">3</i>
    	</b>
    	<c Q:itemType="XS:int">
    		<i XI:type="XS:int">1</i>
    		<i XI:type="XS:int">2</i>
    		<i XI:type="XS:int">3</i>
    	</c>
    	<d Q:nodeType="array">
    		<i XI:type="XS:int">1</i>
    		<i XI:type="XS:int">2</i>
    		<i XI:type="XS:int">3</i>
    	</d>
	    <e Q:arraySize="3" Q:itemType="XS:int">
    		<i>1</i>
    		<i>2</i>
    		<i>3</i>
    	</e>
	</a:foo>
 </E:Body>
</E:Envelope>
